# Exercise 1: Select clause
[โจทย์หน้า: 29](https://luckkrit.github.io/cos3103/slides/2_68/sql_dml)

## Load data

In [24]:
%load_ext sql
# Show more rows in results
%config SqlMagic.displaylimit = 300

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [25]:
%sql postgresql://postgres:12345678@localhost:5432/postgres

Connecting and switching to connection 'postgresql://postgres:***@localhost:5432/postgres'

In [26]:
%sql SELECT version()

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------------------------------------------------------------------+
|                                 version                                 |
+-------------------------------------------------------------------------+
| PostgreSQL 18.1 on x86_64-windows, compiled by msvc-19.44.35221, 64-bit |
+-------------------------------------------------------------------------+

In [27]:
%sql SET search_path TO classicmodels, public

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

++
||
++
++

## Query

### 1. แสดงข้อมูล contries ที่ไม่ซ้ำกันทั้งหมดจากตาราง ```customers```
- ใช้ ```distinct``` เพื่อให้ได้ข้อมูลที่ไม่ซ้ำกัน

In [23]:
%%sql
SELECT distinct country 
FROM customers;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

28 rows affected.

+-------------+
|   country   |
+-------------+
| Switzerland |
| New Zealand |
|    Italy    |
|    Russia   |
|    Sweden   |
+-------------+
Truncated to displaylimit of 5.

### 2. จากตาราง orderdetails ให้แสดง orderNumber, productCode, quanityOrdered, priceEach และจงคำนวนหา total(quanityOrdered * priceEach) และสร้าง colunm เพื่อเก็บผลการคำนวนชื่อ ```lineTotal```

In [17]:
%%sql
SELECT orderNumber, productCode, quantityOrdered, priceEach , 
(quantityOrdered * priceEach) AS lineTotal
FROM orderdetails
Limit 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+-------------+-------------+-----------------+-----------+-----------+
| ordernumber | productcode | quantityordered | priceeach | linetotal |
+-------------+-------------+-----------------+-----------+-----------+
|    10100    |   S18_1749  |        30       |    136    |    4080   |
|    10100    |   S18_2248  |        50       |   55.09   |  2754.50  |
|    10100    |   S18_4409  |        22       |   75.46   |  1660.12  |
|    10100    |   S24_3969  |        49       |   35.29   |  1729.21  |
|    10101    |   S18_2325  |        25       |   108.06  |  2701.50  |
+-------------+-------------+-----------------+-----------+-----------+

### 3. จงใช้ String function ในการแสดงค่าตามนี้
จากตาราง employees
- แสดง colum firstName, lastName
- แสดง colum ชื่อ ```fullName``` โดย colunm นี้จะแสดงชื่อ-สกุล แบบมีช่องระหว่างระหว่างชื่อ-สกุล
- แสดง colum ชื่อ ```emailUsername``` โดยให้แสดงเฉพาะ username เท่านั้น

In [18]:
%%sql
SELECT firstName, lastName, 
concat(firstName, ' ', lastName) AS fullName,
split_part(email,'@',1) AS emailUsername
FROM employees LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+-----------+-----------+-------------------+---------------+
| firstname |  lastname |      fullname     | emailusername |
+-----------+-----------+-------------------+---------------+
|   Diane   |   Murphy  |    Diane Murphy   |    dmurphy    |
|    Mary   | Patterson |   Mary Patterson  |   mpatterso   |
|    Jeff   |  Firrelli |   Jeff Firrelli   |   jfirrelli   |
|  William  | Patterson | William Patterson |   wpatterson  |
|   Gerard  |   Bondur  |   Gerard Bondur   |    gbondur    |
+-----------+-----------+-------------------+---------------+

### 4. จงใช้ String function ในการแสดงค่าตามนี้
จากตาราง products
- productName ใน lower case
- productName ใน upper case
- แสดง length ของ productName

In [19]:
%%sql
SELECT lower(productName) AS lowerName,
upper(productName) AS upperName,
length(productName) AS nameLength
FROM products
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+---------------------------------------+---------------------------------------+------------+
|               lowername               |               uppername               | namelength |
+---------------------------------------+---------------------------------------+------------+
| 1969 harley davidson ultimate chopper | 1969 HARLEY DAVIDSON ULTIMATE CHOPPER |     37     |
|        1952 alpine renault 1300       |        1952 ALPINE RENAULT 1300       |     24     |
|         1996 moto guzzi 1100i         |         1996 MOTO GUZZI 1100I         |     21     |
|  2003 harley-davidson eagle drag bike |  2003 HARLEY-DAVIDSON EAGLE DRAG BIKE |     36     |
|          1972 alfa romeo gta          |          1972 ALFA ROMEO GTA          |     19     |
+---------------------------------------+---------------------------------------+------------+

### 5. จากตาราง products จงแสดง productName, buyPrice, msrp, และสร้าง boolean colunm ชื่อ ```isProfitable``` เพื่อเช็คว่า msrp ดีกว่า buyPrice หรือไม่

In [21]:
%%sql
SELECT productName, buyPrice, MSRP,
(MSRP > buyPrice) AS isProfitable
FROM products 
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+---------------------------------------+----------+--------+--------------+
|              productname              | buyprice |  msrp  | isprofitable |
+---------------------------------------+----------+--------+--------------+
| 1969 Harley Davidson Ultimate Chopper |  48.81   |  95.7  |     True     |
|        1952 Alpine Renault 1300       |  98.58   | 214.3  |     True     |
|         1996 Moto Guzzi 1100i         |  68.99   | 118.94 |     True     |
|  2003 Harley-Davidson Eagle Drag Bike |  91.02   | 193.66 |     True     |
|          1972 Alfa Romeo GTA          |  85.68   |  136   |     True     |
+---------------------------------------+----------+--------+--------------+